# 0514
# IF 조건문 문제 (easy) 힌트!!

# -------------------------------------------------------------#
# 문제 1 : 가격과 쿠폰을 입력받아 할인한 가격을 출력하세요
# -------------------------------------------------------------#

# 가격을 입력받고, 정수형 int로 형변환 하세요

# 쿠폰을 입력받으세요


# if 쿠폰 == "cash300" 이면 :
# 300원 할인한 가격 출력하기

# elif 쿠폰 == "cash500" 이면 :
# 500원 할인한 가격 출력하기

# else
# 입력이 잘못됐다고 출력하기


# -------------------------------------------------------------#
# 문제 2 : 세 과목의 평균을 구하고 합격 불합격을 출력하세요
# -------------------------------------------------------------#


# 세 과목의 점수를 입력받고, 정수형 int로 형변환 하세요
# 점수 각각 input으로 받아도 되고, split()를 이용해서 한 줄에 받을 수도 있어요!

# 세 과목 점수 평균 구하기

# if 평균이 50점 이상이면 :
#   합격! 이라고 출력하기
# 아니라면 : 
#   불합격! 이라고 출력하기