# 0514
# IF 조건문 문제 힌트!!

# ---------------------------------------------------------------#
# 문제 1 : 정수 하나를 입력받아 양수음수/홀수짝수 여부 판단하기
# ---------------------------------------------------------------#

# input으로 입력받고, 정수형int으로 형변환하기


# if 양수인지 음수인지  ( 0 보다 크면 양수, 작으면 음수)

# else


# if 짝수인지 홀수인지 ( % 연산자 활용하기! )

# else



# ---------------------------------------------------------------#
# 문제 2 : 성적 입력하기
# ---------------------------------------------------------------#

# input으로 입력받고, 정수int 로 형변환하기

# if 85점 이상이면 성적 A 출력하기

# elif 70점 이상이면 성적 B 출력하기

# elif 50점 이상이면 성적 C 출력하기

# else 성적 F 출력하기



# ---------------------------------------------------------------#
# 문제 3 : if 를 사용해서 오름차순으로 출력하기
# ---------------------------------------------------------------#

# 두 개의 값을 입력받고, 정수int 로 형변환하기 ( map 과 split() 활용해보기 )


# if 두 개의 숫자를 비교해서 작은 숫자가 앞에 오도록 출력하기

# else



# ---------------------------------------------------------------#
# 문제 3 심화
# ---------------------------------------------------------------#

# n1, n2, n3 세 개의 값을 입력받고, 정수int 로 형변환 하기


# if n1 < n2 : 
    # if

    #elif

    #else


# elif n2 < n1 : 
    # if

    #elif
    
    #else



# ---------------------------------------------------------------# 
# 문제 4 : 연도를 입력받아 해당 연도가 윤년인지
# ---------------------------------------------------------------#

# 값 입력받기, 형변환 하기

# if 연도가 400으로 나누어떨어지거나 (윤년)

# elif 연도가 4로 나누어진다 "그리고" 100으로도 안나눠진다 (윤년)

# else (윤년이 아님)




# ---------------------------------------------------------------#
# 문제 5 : 두 자리의 서로 다른 정수 두 개를 입력받아 각 자리수의 숫자들이 일치하는지 비교하기
# ---------------------------------------------------------------#

# 두 개의 값 입력받기, 형변환하기

# 십의 자리 숫자, 일의 자리 숫자 구하기 ( // 와 % 를 활용하기)


# if 숫자들이 일치하는지, 부분적으로 일치하는 지 조건 세우기 (and 와 or 활용하기)




# ---------------------------------------------------------------#
# 문제 6 : 양의 정수 하나를 입력받아 이 정수가 2의 배수인지 3의 배수인지? nested if 사용하기
# ---------------------------------------------------------------#


# 값을 입력받기, 형변환하기

# nested if : if 문 안에 if 문 사용하기

# if 2로 나누어떨어지고
    # if 3으로 나누어떨어지면

    # else

# elif 3으로 나누어떨어지면

# else




# ---------------------------------------------------------------#
# 문제 7 : 연도를 입력받아 해당 연도의 띠를 출력하세요
# ---------------------------------------------------------------#

# 값 입력받기, 형변환하기


# if 조건문 작성하기 ( % 활용하기 )


